In [51]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime 
import ast
import json

In [52]:
pd.set_option('display.max_colwidth', None)

In [53]:
dfgenres= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Genres.csv')
dfgenres.head()

,id,genres
0,862,"[{'id': 16, 'name': 'Animation'}, {'id': 35, 'name': 'Comedy'}, {'id': 10751, 'name': 'Family'}]"
1,15602,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, 'name': 'Comedy'}]"
2,11862,"[{'id': 35, 'name': 'Comedy'}]"
3,710,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, 'name': 'Action'}, {'id': 53, 'name': 'Thriller'}]"
4,21032,"[{'id': 10751, 'name': 'Family'}, {'id': 16, 'name': 'Animation'}, {'id': 12, 'name': 'Adventure'}]"

In [54]:
dfgenres.sort_values(by='id', ascending=False)

,id,genres
1584,9992,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, 'name': 'Fantasy'}, {'id': 16, 'name': 'Animation'}, {'id': 10751, 'name': 'Family'}]"
4371,9990,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'name': 'Thriller'}, {'id': 80, 'name': 'Crime'}, {'id': 18, 'name': 'Drama'}]"
3054,99861,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'name': 'Adventure'}, {'id': 878, 'name': 'Science Fiction'}]"
2362,99770,"[{'id': 10751, 'name': 'Family'}, {'id': 12, 'name': 'Adventure'}, {'id': 35, 'name': 'Comedy'}]"
3640,99760,"[{'id': 18, 'name': 'Drama'}]"
...,...,...
1039,10009,"[{'id': 12, 'name': 'Adventure'}, {'id': 16, 'name': 'Animation'}, {'id': 10751, 'name': 'Family'}]"
1536,10007,"[{'id': 27, 'name': 'Horror'}, {'id': 53, 'name': 'Thriller'}]"
2203,10005,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'name': 'Adventure'}, {'id': 53, 'name': 'Thriller'}]"
2867,100042,"[{'id': 35, 'name': 'Comedy'}]"
207,10003,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'name': 'Action'}, {'id': 10749, 'name': 'Romance'}, {'id': 878, 'name': 'Science Fiction'}, {'id': 12, 'name': 'Adventure'}]"

In [55]:
dfgenres['genres'] = dfgenres['genres'].apply(ast.literal_eval)

In [56]:
df_exploded = dfgenres.explode('genres', ignore_index=True) 
df_exploded.head()

      id                            genres
0    862   {'id': 16, 'name': 'Animation'}
1    862      {'id': 35, 'name': 'Comedy'}
2    862   {'id': 10751, 'name': 'Family'}
3  15602  {'id': 10749, 'name': 'Romance'}
4  15602      {'id': 35, 'name': 'Comedy'}

In [57]:
df_exploded['name_genres'] = df_exploded['genres'].apply(lambda x: x.get('name', '') if isinstance(x, dict) else '')
df_exploded['id_genres'] = df_exploded['genres'].apply(lambda x: x.get('id', '') if isinstance(x, dict) else '')

In [71]:
df_exploded.head()

      id                            genres name_genres id_genres
0    862   {'id': 16, 'name': 'Animation'}   Animation        16
1    862      {'id': 35, 'name': 'Comedy'}      Comedy        35
2    862   {'id': 10751, 'name': 'Family'}      Family     10751
3  15602  {'id': 10749, 'name': 'Romance'}     Romance     10749
4  15602      {'id': 35, 'name': 'Comedy'}      Comedy        35

In [59]:
df_exploded.drop(columns='genres')

           id name_genres id_genres
0         862   Animation        16
1         862      Comedy        35
2         862      Family     10751
3       15602     Romance     10749
4       15602      Comedy        35
...       ...         ...       ...
11151   19307      Comedy        35
11152   21251      Comedy        35
11153  460135   Animation        16
11154  182030      Action        28
11155  182030     Foreign     10769

[11156 rows x 3 columns]

In [60]:
grouped_df = df_exploded.groupby('id').agg({'name_genres': lambda x: "'" + "' '".join(x) + "'",
                                           'id_genres': lambda x: "'" + ','.join(map(str, x)) + "'"}).reset_index()

grouped_df

,id,name_genres,id_genres
0,10003,'Thriller' 'Action' 'Romance' 'Science Fiction' 'Adventure',"'53,28,10749,878,12'"
1,100042,'Comedy','35'
2,10005,'Action' 'Adventure' 'Thriller',"'28,12,53'"
3,10007,'Horror' 'Thriller',"'27,53'"
4,10009,'Adventure' 'Animation' 'Family',"'12,16,10751'"
...,...,...,...
4483,99760,'Drama','18'
4484,99770,'Family' 'Adventure' 'Comedy',"'10751,12,35'"
4485,99861,'Action' 'Adventure' 'Science Fiction',"'28,12,878'"
4486,9990,'Action' 'Thriller' 'Crime' 'Drama',"'28,53,80,18'"
4487,9992,'Adventure' 'Fantasy' 'Animation' 'Family',"'12,14,16,10751'"

In [61]:
grouped_df.sort_values(by='id', ascending=False)

,id,name_genres,id_genres
4487,9992,'Adventure' 'Fantasy' 'Animation' 'Family',"'12,14,16,10751'"
4486,9990,'Action' 'Thriller' 'Crime' 'Drama',"'28,53,80,18'"
4485,99861,'Action' 'Adventure' 'Science Fiction',"'28,12,878'"
4484,99770,'Family' 'Adventure' 'Comedy',"'10751,12,35'"
4483,99760,'Drama','18'
...,...,...,...
4,10009,'Adventure' 'Animation' 'Family',"'12,16,10751'"
3,10007,'Horror' 'Thriller',"'27,53'"
2,10005,'Action' 'Adventure' 'Thriller',"'28,12,53'"
1,100042,'Comedy','35'
0,10003,'Thriller' 'Action' 'Romance' 'Science Fiction' 'Adventure',"'53,28,10749,878,12'"

In [75]:
hola2= grouped_df[grouped_df['id']== '862']
hola2

       id                    name_genres      id_genres
4180  862  'Animation' 'Comedy' 'Family'  '16,35,10751'

In [62]:
grouped_df['id'].unique()

array(['10003', '100042', '10005', ..., '99861', '9990', '9992'],
      dtype=object)

In [63]:
df_exploded['id'].unique()

array(['862', '15602', '11862', ..., '21251', '460135', '182030'],
      dtype=object)

In [72]:
## creo el CSV DE LOS GENEROS CON LOS IDS DE LAS PELICULAS
grouped_df.to_csv('GenerosFinalPORid.csv', index=False)